{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "trainable": true, "output_shape": null, "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-2-f477e69b9209>\u00da\b<lambda>e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "nb_filter": 24, "b_regularizer": null, "name": "convolution2d_1", "nb_col": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "nb_filter": 36, "b_regularizer": null, "name": "convolution2d_2", "nb_col": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "nb_filter": 48, "b_regularizer": null, "name": "convolution2d_3", "nb_col": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "name": "convolution2d_4", "nb_col": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "name": "convolution2d_5", "nb_col": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 1152, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 1164, "activation": "linear", "name": "dense_1", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 1164, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 100, "activation": "linear", "name": "dense_2", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 100, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 50, "activation": "linear", "name": "dense_3", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 50, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 10, "activation": "linear", "name": "dense_4", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "init": "he_normal", "input_dim": 10, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 1, "activation": "linear", "name": "dense_5", "activity_regularizer": null}}], "keras_version": "1.2.1"}