{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 3], "subsample": [4, 4], "bias": true, "trainable": true, "nb_col": 8, "nb_filter": 16, "activity_regularizer": null, "activation": "linear", "input_dtype": "float32", "nb_row": 8, "border_mode": "same", "b_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "trainable": true, "nb_col": 5, "nb_filter": 32, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "border_mode": "same", "b_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "trainable": true, "nb_col": 5, "nb_filter": 64, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "border_mode": "same", "b_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_1", "output_dim": 512, "bias": true, "init": "glorot_uniform", "input_dim": 3200, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_2", "output_dim": 1, "bias": true, "init": "glorot_uniform", "input_dim": 512, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null}}]}