{"config": [{"config": {"name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-2-5f796eff7954>\u00da\b<lambda>e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "input_dtype": "float32", "trainable": true}, "class_name": "Lambda"}, {"config": {"bias": true, "activation": "linear", "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 24, "name": "convolution2d_1", "dim_ordering": "tf", "init": "he_normal", "nb_row": 5, "trainable": true, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 36, "name": "convolution2d_2", "dim_ordering": "tf", "init": "he_normal", "nb_row": 5, "trainable": true, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 48, "name": "convolution2d_3", "dim_ordering": "tf", "init": "he_normal", "nb_row": 5, "trainable": true, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_4", "dim_ordering": "tf", "init": "he_normal", "nb_row": 3, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_5", "dim_ordering": "tf", "init": "he_normal", "nb_row": 3, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "output_dim": 1164, "init": "he_normal", "trainable": true, "W_regularizer": null, "input_dim": 1152, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "name": "dense_2", "output_dim": 100, "init": "he_normal", "trainable": true, "W_regularizer": null, "input_dim": 1164, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "name": "dense_3", "output_dim": 50, "init": "he_normal", "trainable": true, "W_regularizer": null, "input_dim": 100, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "name": "dense_4", "output_dim": 10, "init": "he_normal", "trainable": true, "W_regularizer": null, "input_dim": 50, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"bias": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "name": "dense_5", "output_dim": 1, "init": "he_normal", "trainable": true, "W_regularizer": null, "input_dim": 10, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}