{"config": [{"config": {"batch_input_shape": [null, 80, 160, 3], "nb_col": 8, "name": "convolution2d_1", "trainable": true, "b_regularizer": null, "activation": "linear", "subsample": [4, 4], "b_constraint": null, "border_mode": "same", "nb_filter": 16, "input_dtype": "float32", "nb_row": 8, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 5, "name": "convolution2d_2", "trainable": true, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_filter": 32, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 5, "name": "convolution2d_3", "trainable": true, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 512, "activity_regularizer": null, "name": "dense_1", "trainable": true, "activation": "linear", "b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 3200, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 1, "activity_regularizer": null, "name": "dense_2", "trainable": true, "activation": "linear", "b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 512, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}