{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-2-50f2d2039b82>\u00da\b<lambda>f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "trainable": true, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "output_shape": null}, "class_name": "Lambda"}, {"config": {"activation": "linear", "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 24, "nb_row": 5, "name": "convolution2d_1", "activity_regularizer": null, "nb_col": 5, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 36, "nb_row": 5, "name": "convolution2d_2", "activity_regularizer": null, "nb_col": 5, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 48, "nb_row": 5, "name": "convolution2d_3", "activity_regularizer": null, "nb_col": 5, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_4", "activity_regularizer": null, "nb_col": 3, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_5", "activity_regularizer": null, "nb_col": 3, "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "b_constraint": null, "output_dim": 1164, "trainable": true, "W_regularizer": null, "input_dim": 1152, "bias": true, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "output_dim": 100, "trainable": true, "W_regularizer": null, "input_dim": 1164, "bias": true, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "output_dim": 50, "trainable": true, "W_regularizer": null, "input_dim": 100, "bias": true, "b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "output_dim": 10, "trainable": true, "W_regularizer": null, "input_dim": 50, "bias": true, "b_regularizer": null, "name": "dense_4", "activity_regularizer": null, "W_constraint": null, "init": "he_normal"}, "class_name": "Dense"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "output_dim": 1, "trainable": true, "W_regularizer": null, "input_dim": 10, "bias": true, "b_regularizer": null, "name": "dense_5", "activity_regularizer": null, "W_constraint": null, "init": "he_normal"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}